<!-- add-pr-comment:add-pr-comment -->

Terraform Plan **production **:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.crom_eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = (known after apply)
    }

  # module.crom_eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Environment"
+       resource_id = (known after apply)
+       value       = "Production"
    }

  # module.crom_eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Project"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Project"
+       resource_id = (known after apply)
+       value       = "web-app-kube"
    }

  # module.crom_eks.module.eks.aws_eks_cluster.this[0] will be created
+   resource "aws_eks_cluster" "this" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = [
+           "api",
+           "audit",
+           "authenticator",
        ]
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       name                      = "webapp-kube"
+       platform_version          = (known after apply)
+       role_arn                  = "arn:aws:iam::520291287938:role/webapp-kube-cluster-20231205203052131000000003"
+       status                    = (known after apply)
+       tags                      = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
+       tags_all                  = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
+       version                   = "1.28"

+       encryption_config {
+           resources = [
+               "secrets",
            ]

+           provider {
+               key_arn = "arn:aws:kms:us-east-1:520291287938:key/4a6cf832-3d6d-408c-9366-7bc4e592e4f9"
            }
        }

+       kubernetes_network_config {
+           ip_family         = (known after apply)
+           service_ipv4_cidr = (known after apply)
+           service_ipv6_cidr = (known after apply)
        }

+       timeouts {}

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = true
+           endpoint_public_access    = true
+           public_access_cidrs       = [
+               "0.0.0.0/0",
            ]
+           security_group_ids        = [
+               "sg-02751fc3eeab1bbdd",
            ]
+           subnet_ids                = [
+               "subnet-01d798507f627e50d",
+               "subnet-05391fa6e24de765b",
+               "subnet-08d4f8578ab9e3797",
            ]
+           vpc_id                    = (known after apply)
        }
    }

  # module.crom_eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+   resource "aws_iam_openid_connect_provider" "oidc_provider" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags            = {
+           "Environment" = "Production"
+           "Name"        = "webapp-kube-eks-irsa"
+           "Project"     = "web-app-kube"
        }
+       tags_all        = {
+           "Environment" = "Production"
+           "Name"        = "webapp-kube-eks-irsa"
+           "Project"     = "web-app-kube"
        }
+       thumbprint_list = (known after apply)
+       url             = (known after apply)
    }

  # module.crom_eks.module.eks.time_sleep.this[0] will be created
+   resource "time_sleep" "this" {
+       create_duration = "30s"
+       id              = (known after apply)
+       triggers        = {
+           "cluster_certificate_authority_data" = (known after apply)
+           "cluster_endpoint"                   = (known after apply)
+           "cluster_name"                       = "webapp-kube"
+           "cluster_version"                    = "1.28"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy. 
```

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.crom_eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.crom_eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + resource_id = (known after apply)
      + value       = "Production"
    }

  # module.crom_eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Project"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Project"
      + resource_id = (known after apply)
      + value       = "web-app-kube"
    }

  # module.crom_eks.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "webapp-kube"
      + platform_version          = (known after apply)
      + role_arn                  = "arn:aws:iam::520291287938:role/webapp-kube-cluster-20231205203052131000000003"
      + status                    = (known after apply)
      + tags                      = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
      + tags_all                  = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
      + version                   = "1.28"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:us-east-1:520291287938:key/4a6cf832-3d6d-408c-9366-7bc4e592e4f9"
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-02751fc3eeab1bbdd",
            ]
          + subnet_ids                = [
              + "subnet-01d798507f627e50d",
              + "subnet-05391fa6e24de765b",
              + "subnet-08d4f8578ab9e3797",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.crom_eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Environment" = "Production"
          + "Name"        = "webapp-kube-eks-irsa"
          + "Project"     = "web-app-kube"
        }
      + tags_all        = {
          + "Environment" = "Production"
          + "Name"        = "webapp-kube-eks-irsa"
          + "Project"     = "web-app-kube"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.crom_eks.module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "webapp-kube"
          + "cluster_version"                    = "1.28"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
 
```